'use client';

import Image from "next/image";
import { useEffect, useRef, useState } from "react";
import { ChevronDown } from 'lucide-react';

import Navbar from "../components/Navbar";
import Product from "../components/Product";

interface ScrollIndicatorProps {
  children: React.ReactNode;
  maxHeight: string;
}

export default function Home() {
  
  return (
   <div className="min-h-screen">
      <div className="mx-auto">
          <Navbar /> 
          <div className="flex-col">
            <section className="flex min-h-screen w-full snap-start py-32" id="home">
              <div className="flex flex-col-reverse items-center justify-center gap-8 lg:flex-row">
                  <div className="p-10 pl-10 sm:pl-40  flex flex-1 flex-col justify-normal md:justify-center">
                    <h1 className="text-7xl  font-bold">
                      DataDI
                    </h1>
                    <h1 className="mb-10  text-xl sm:text-3xl font-bold">
                      -YOUR DATA, YOUR VALUE-
                    </h1>
                    <p>
                      {/* Дата Дижитс Инноваци
                      ХХК-н Big Data
                      Management болон
                      нэгдсэн өгөгдлийн сангаар
                      дагнан мэргэшсэн дата
                      суурьтай технологийн
                      компани юм. */}
                      Data Digits Innovation LLC is a database technology company specializing in Big Data Management and integrated databases.
                    </p>
                  </div>
                  <div className="p-10 flex flex-1 flex-col justify-normal md:justify-center">
                        <Image 
                                src="/front.png" 
                                className="a rounded-xl" 
                                alt="logo" 
                                width="0"
                                height="0"
                                sizes={"(max-width: 640px) 200vw, (max-width: 1024px) 200vw, 1024px"}
                                style={{ width: '100%', height: 'auto' }} 
                        />
                  </div>
              </div>
            </section>
            <section className="min-h-screen w-full snap-start py-24" id="product">
              <div className="container mx-auto xl:max-w-7xl">
                <div className="py-12">
                  <div className="grid grid-cols-1 lg:grid-cols-2 gap-12">
                     <Product 
                        logosvg={
                          <svg className="w-10 h-10 dark:fill-white fill-black" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 1920 1920">
                            <g fillRule="evenodd">
                                <path fillRule="nonzero" d="M0 53v1813.33h1386.67v-320H1280v213.34H106.667V159.667H1280V373h106.67V53z"/>
                                <path d="M1226.67 1439.67c113.33 0 217.48-39.28 299.6-104.96l302.37 302.65c20.82 20.84 54.59 20.85 75.42.04 20.84-20.82 20.86-54.59.04-75.43l-302.41-302.68c65.7-82.12 104.98-186.29 104.98-299.623 0-265.097-214.91-480-480-480-265.1 0-480.003 214.903-480.003 480 0 265.093 214.903 480.003 480.003 480.003Zm0-106.67c206.18 0 373.33-167.15 373.33-373.333 0-206.187-167.15-373.334-373.33-373.334-206.19 0-373.337 167.147-373.337 373.334 0 206.183 167.147 373.333 373.337 373.333Z"/>
                            </g>
                        </svg>
                        }
                        title={"Assessment"}
                        desciption={"Дата үнэлгээний хэсэгт өгөгдлийн чанар, үнэн зөв байдал, бүрэн бүтэн байдал, болон ашиглалтын боломжийг тодорхойлох зорилгоор хийгдсэн үнэлгээг багтаана. Энэхүү үнэлгээгээр өгөгдлийн найдвартай байдал, тохиромжтой эсэхийг тодорхойлох, шаардлагатай сайжруулалтуудыг илрүүлэхэд ашиглана."}
                        longDescription={
                          <div className="text-sm text-justify">
                            <ul>
                              <li>
                              <b>Системийн үнэлгээ:</b> Системийн үнэлгээ нь тухайн системийн гүйцэтгэл, найдвартай байдал, аюулгүй байдал, өргөтгөх боломж, хэрэглэгчийн туршлага зэрэг олон талын үзүүлэлтийг үнэлж, дүгнэх үйл явц юм. Энэ үнэлгээ нь системийн үр ашигтай ажиллагааг хангах, боломжит сайжруулалтуудыг тодорхойлох, илэрсэн асуудлуудыг шийдвэрлэхэд чиглэнэ. Үнэлгээний үр дүнд системийн шинэчлэлт, хөгжүүлэлт, засвар үйлчилгээ хийх шаардлагатай эсэхийг тодорхойлно.
                              </li>
                              <li>
                              <b>Өгөгдлийн сангийн үнэлгээ:</b> Өгөгдлийн сангийн үнэлгээ нь өгөгдлийн бүтэц, ажиллагаа, аюулгүй байдал, хурд, өргөтгөх боломж зэрэг үзүүлэлтийг үнэлэх үйл явц юм. Энэхүү үнэлгээгээр өгөгдлийн сангийн үр ашигтай байдал, өгөгдлийг хандах хурд, найдвартай байдал, болон хамгаалалт зэргийг тодорхойлж, сайжруулах шаардлагатай хэсгүүдийг илрүүлдэг. Мөн өгөгдлийн сангийн загвар зохион байгуулалт, индексүүд, хүснэгтийн харилцан хамаарал зэрэгт дүн шинжилгээ хийж, өгөгдлийн сангийн гүйцэтгэлийг сайжруулах арга замуудыг тодорхойлно.
                              </li>
                              <li>
                              <b>Өгөгдлийн чанарын үнэлгээ:</b>Өгөгдлийн чанарын үнэлгээ нь өгөгдлийн үнэн зөв байдал, бүрэн бүтэн байдал, давхардалгүй байдал, холбогдох байдал зэрэг үзүүлэлтүүдийг үнэлж, өгөгдлийн бодит хэрэглээнд нийцэж байгаа эсэхийг тодорхойлох үйл явц юм. Өгөгдлийн чанарын үнэлгээ нь мэдээллийн найдвартай байдал, ашиглалтын боломжийг сайжруулах, бизнесийн шийдвэр гаргалтад дэмжлэг үзүүлэхэд чухал ач холбогдолтой. Энэхүү үнэлгээгээр өгөгдлийн чанарыг сайжруулах шаардлагатай хэсгүүдийг тодорхойлж, өгөгдлийн бүрэн бүтэн байдал, нарийвчлалыг хангах арга хэмжээг боловсруулдаг.
                              </li>
                            </ul>
                          </div>
                        }
                     />
                     <Product
                        logosvg={
                          <svg className="w-10 h-10" xmlns="http://www.w3.org/2000/svg"   viewBox="0 0 512 512" version="1.1">
                              <title>report-barchart</title>
                              <g id="Page-1" stroke="none" strokeWidth="1" fill="none" fillRule="evenodd">
                                  <g className="dark:fill-white fill-black" id="add"  transform="translate(42.666667, 85.333333)">
                                      <path d="M341.333333,1.42108547e-14 L426.666667,85.3333333 L426.666667,341.333333 L3.55271368e-14,341.333333 L3.55271368e-14,1.42108547e-14 L341.333333,1.42108547e-14 Z M330.666667,42.6666667 L42.6666667,42.6666667 L42.6666667,298.666667 L384,298.666667 L384,96 L330.666667,42.6666667 Z M106.666667,85.3333333 L106.666,234.666 L341.333333,234.666667 L341.333333,256 L85.3333333,256 L85.3333333,85.3333333 L106.666667,85.3333333 Z M170.666667,149.333333 L170.666667,213.333333 L128,213.333333 L128,149.333333 L170.666667,149.333333 Z M234.666667,106.666667 L234.666667,213.333333 L192,213.333333 L192,106.666667 L234.666667,106.666667 Z M298.666667,170.666667 L298.666667,213.333333 L256,213.333333 L256,170.666667 L298.666667,170.666667 Z" id="Combined-Shape">

                          </path>
                                  </g>
                              </g>
                          </svg>
                        }
                        title={"BI & Reporting"}
                        desciption={"BI (Business Intelligence) нь бизнесийн өгөгдлийг цуглуулж, боловсруулан, анализ хийж, визуал хэлбэрээр тайлан гарган, мэдээлэлд тулгуурлан шийдвэр гаргах үйл явцыг дэмжихэд ашиглагддаг технологи, арга хэрэгслүүдийн нэгдэл юм"}
                        longDescription={
                          <div className="text-sm text-justify">
                            <p>
                              <b>Business Intelligence (BI)</b> гэдэг нь бизнесийн байгууллагуудын өгөгдлийг цуглуулах, боловсруулж, дүн шинжилгээ хийх, тайлан гаргах замаар мэдээлэлд суурилсан шийдвэр гаргах үйл явцыг хялбаршуулах зорилготой программ хангамж, арга хэрэгслүүдийг хэлдэг. BI нь бизнесийн мэдээллийг цогцоор нь харах боломжийг олгож, байгууллагын үйл ажиллагааны үр ашиг, өсөлт, ашиг орлогыг нэмэгдүүлэхэд тусалдаг.
                            </p>
                            <p>
                              BI платформууд нь өгөгдлийг хурдан бөгөөд үр дүнтэй холбож, хэрэглэгчид олон төрлийн өгөгдлийн эх үүсвэрээс мэдээллийг оруулж, харьцуулан, ойлгоход хялбар байдлаар үзүүлэх боломжийг олгодог. Tableau болон Power BI нь хоёр шилдэг BI платформ бөгөөд тус тусдаа онцлог давуу талуудтай.
                            </p>
                            <p>
                              <b>Tableau</b> бол өгөгдлийг ойлгомжтой, визуал байдлаар дүрслэхэд зориулагдсан хүчирхэг программ хангамж юм. Энэ платформ нь бизнесийн өгөгдлийг анализ хийх, хянах самбар үүсгэх, болон өгөгдлийг график хэлбэрээр дүрслэх боломжийг олгодог. Tableau нь өгөгдлийг хурдан бөгөөд үр дүнтэй холбож, олон төрлийн өгөгдлийн эх үүсвэрээс мэдээллийг оруулж, харьцуулан, ойлгоход хялбар байдлаар үзүүлж чаддаг. Гэхдээ энэ платформыг эхлэн суралцагчид болон програмчлалын мэдлэг багатай хүмүүст сурахад бага зэрэг хугацаа шаардагдаж магадгүй.
                            </p>
                            <p>
                              <b>Power BI</b> бол Microsoft-ын бүтээсэн бизнесийн дүн шинжилгээний платформ бөгөөд энэ нь өгөгдлийг анализ хийх, тайлан гаргах, хянах самбар үүсгэхэд чиглэгдсэн юм. Power BI нь Microsoft-ын бусад бүтээгдэхүүнүүдтэй төгс нийцдэг бөгөөд Excel, Azure, SQL Server зэрэг системүүдтэй өгөгдөл солилцох болон холбогдох боломжийг бүрэн дэмждэг. Мөн энэ платформ нь хэрэглэгчдэд тохиромжтой интерфэйсээр хангагдсан тул програмчлалын мэдлэг багатай хүмүүс ч үр дүнтэйгээр ашиглаж чадна.
                            </p>
                            <p>
                            <b>Report</b> нь өгөгдлийг тодорхой нэг форматад оруулж, системчилсэн байдлаар дүрсэлсэн баримт бичиг юм. BI платформууд ашиглан гаргасан тайлангууд нь байгууллагын үйл ажиллагааны гүйцэтгэлийг хянах, дүгнэлт хийх, стратеги боловсруулж, шийдвэр гаргахад чухал ач холбогдолтой. Тайлангууд нь бизнесийн гол үзүүлэлтүүдийг харуулж, өнгөрсөн үйл явдлуудын талаархи мэдээллийг өгч, ирээдүйн төлөвлөлтөд суурь болдог.
                            </p>
                          </div>
                        }
                      />
                      <Product
                        logosvg={
                          <svg className="w-10 h-10" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24" fill="none">
                          <path className="dark:fill-white fill-black" fillRule="evenodd" clipRule="evenodd" d="M6 1C4.34314 1 3 2.34315 3 4V20C3 21.6569 4.34315 23 6 23H19C20.6569 23 22 21.6569 22 20V10C22 9.73478 21.8946 9.48043 21.7071 9.29289L13.7071 1.29292C13.6114 1.19722 13.4983 1.1229 13.3753 1.07308C13.2572 1.02527 13.1299 1 13 1H6ZM12 3H6C5.44771 3 5 3.44771 5 4V20C5 20.5523 5.44772 21 6 21H19C19.5523 21 20 20.5523 20 20V11H13C12.4477 11 12 10.5523 12 10V3ZM18.5858 9.00003L14 4.41424V9.00003H18.5858Z" />
                          </svg>
                        }
                        title={"Documentation"}
                        desciption={"Баримт бичиг бэлтгэх нь төслийн амжилттай хэрэгжилт, үр дүнтэй харилцаа холбоог хангахад чухал үүрэгтэй. Энэ нь төслийн явцын хяналт, дүн шинжилгээ хийх, шийдвэр гаргах, мэдлэг хуваалцах, түүх хадгалах зэрэгт ашиглагдана. Баримт бичиг нь төслийн мэдээллийг нэгтгэж, бүх оролцогчдод ойлгомжтой, хүртээмжтэй байх боломжийг олгодог."}
                        longDescription={
                          <div className="text-sm text-justify">
                            <p>
                            Data Lake, Data Warehouse, болон Lakehouse системүүдийн баримт бичгийг гаргах нь эдгээр системүүдийг зөв тохируулж ашиглахад маш чухал үүрэг гүйцэтгэдэг. Баримт бичигт дараах зүйлсийг тусгах шаардлагатай:
                            </p>
                            <ul className="list-disc ml-4">
                            <li>
                            Системийн архитектурын зураглал: Системийн бүтэц, үндсэн бүрэлдэхүүн хэсгүүд, хоорондын харилцааг тодорхой харуулсан зураглалууд.
                            </li>
                            <li>
                            Суулгалт ба тохиргоо: Системийг хэрхэн суулгах, шаардлагатай програм хангамж болон тохиргоонуудын талаар дэлгэрэнгүй заавар.
                            </li>
                            <li>
                            Өгөгдлийн урсгал ба үйл явц: Өгөгдөл хэрхэн цуглуулах, хадгалах, боловсруулах талаар тодорхойлолт. Энэ нь ETL (Extract, Transform, Load) процессуудыг хэрхэн зохион байгуулах талаар мэдээлэл багтана.
                            </li>
                            <li>
                            Аюулгүй байдал ба нууцлал: Өгөгдлийн нууцлал, хамгаалалттай холбоотой бүх арга хэмжээ, зөвлөмжүүд, түвшингүүд.
                            </li>
                            <li>
                            Хяналт ба засвар үйлчилгээ: Системийн ажиллагааг хянах, алдаа илрүүлэх, засвар үйлчилгээ хийх талаархи зааварчилгаа.
                            </li>
                            <li>
                            Автоматжуулалт: Давтагддаг үйл явцыг автоматжуулах аргачлал, ашиглах скриптүүд, автоматжуулалтын хэрэгслүүд.
                            </li>
                            </ul>
                            <p>
                            Эдгээр баримт бичгүүд нь системийг үр ашигтай ашиглах, удирдах, хөгжүүлэхэд чухал үүрэг гүйцэтгэдэг бөгөөд хэрэглэгчдэд системийн талаар ойлголт өгөх, үйл ажиллагааны үр дүнг сайжруулахад тусалдаг.
                            </p>
                          </div>
                        }
                      />
                      <Product
                        logosvg={
                          <svg className="w-10 h-10 dark:fill-white" xmlns="http://www.w3.org/2000/svg" version="1.1" id="_x32_" viewBox="0 0 512 512"><g><path d="M455.925,324.816v-0.305c-43.168,34.714-115.123,56.648-200,56.648c-74.15,0-138.432-16.743-182.279-44.12   c-6.223-3.94-12.07-8.112-17.48-12.524v0.178c-0.076-0.062-0.162-0.119-0.24-0.182v92.043c0,52.626,89.717,95.445,200,95.445   s200-42.819,200-95.445v-56.488l0.15-35.363C456.026,324.742,455.974,324.777,455.925,324.816z"></path><path d="M255.925,340.831c110.283,0,200-42.82,200-95.444v-5.188V201.87v-16.675l0.15-10.437   c-0.049,0.039-0.102,0.074-0.15,0.113v-0.301c-43.168,34.714-115.123,56.648-200,56.648c-74.117,0-138.375-16.73-182.221-44.087   c-6.244-3.952-12.111-8.137-17.539-12.562v0.182c-0.076-0.062-0.162-0.119-0.24-0.182v27.3v38.329v5.188   C55.925,298.012,145.642,340.831,255.925,340.831z"></path><path d="M255.925,190.89c110.283,0,200-42.819,200-95.444c0-1.507-0.328-2.974-0.472-4.463   c-0.836-8.539-3.844-16.81-9.098-24.622C420.507,27.918,344.952,0,255.925,0C166.898,0,91.343,27.918,65.497,66.36   c-5.256,7.812-8.264,16.083-9.098,24.622c-0.147,1.488-0.475,2.956-0.475,4.463C55.925,148.07,145.642,190.89,255.925,190.89z"></path></g></svg>
                        }
                        title={"Database Management"}
                        desciption={"Дата удирдлага нь байгууллагын өгөгдлийг үр ашигтайгаар цуглуулах, хадгалах, боловсруулж, ашиглахад чиглэсэн цогц үйл явц юм. Дата удирдлагад Data Lake, Data Warehouse, болон Lakehouse зэрэг технологиудыг ашигладаг."}
                        longDescription={
                          <div className="text-sm text-justify">
                            <ul className="list-disc ml-4">
                            <li>
                            Data Lake нь бүтэцтэй болон бүтэцгүй их хэмжээний өгөгдлийг түүхий хэлбэрээр нь хадгалж, боловсруулалтад бэлтгэх боломжтой уян хатан хадгалах систем юм.
                            </li>
                            <li>
                            Data Warehouse нь бүтэцтэй өгөгдлийг зохион байгуулалттай байдлаар хадгалж, дүн шинжилгээ хийхэд ашиглагддаг. Энэ нь өгөгдлийн шинжилгээ, тайлан гаргах, шийдвэр гаргах процесст тохиромжтой.
                            </li>
                            <li>
                            Lakehouse нь Data Lake болон Data Warehouse-ын хослол бөгөөд түүхий өгөгдлийг хадгалах, шинжлэх боломжийг нэг дор хангадаг шинэлэг архитектур юм.
                            </li>
                            </ul>
                            <p>
                            Эдгээр технологиудыг хослуулснаар байгууллагууд өгөгдлөө илүү үр ашигтай удирдаж, шийдвэр гаргах процесст үнэн зөв мэдээлэл ашиглах боломжтой болно.
                            </p>
                          </div>
                        }
                      />
                      <Product
                        logosvg={<svg className="w-10 h-10 dark:fill-white" xmlns="http://www.w3.org/2000/svg" version="1.1" id="Capa_1" viewBox="0 0 330 330"><g><path d="M315,120h-22.689c-1.587-4.488-3.415-8.893-5.476-13.196l16.05-16.051c5.858-5.857,5.858-15.355,0-21.213L260.46,27.114   c-5.857-5.858-15.355-5.858-21.213,0l-16.051,16.05c-4.303-2.06-8.707-3.887-13.196-5.476V15c0-8.284-6.716-15-15-15h-60   c-8.284,0-15,6.716-15,15v22.689c-4.488,1.588-8.893,3.415-13.195,5.475l-16.051-16.05c-5.857-5.859-15.355-5.858-21.213,0   L27.114,69.54c-2.813,2.813-4.394,6.628-4.394,10.606s1.58,7.794,4.394,10.606l16.051,16.051c-2.06,4.304-3.888,8.708-5.476,13.196   H15c-8.284,0-15,6.716-15,15v60c0,8.284,6.716,15,15,15h22.689c1.588,4.488,3.416,8.893,5.476,13.196l-16.051,16.051   c-2.813,2.813-4.394,6.628-4.394,10.606s1.58,7.794,4.394,10.606l42.428,42.426c5.858,5.859,15.355,5.857,21.213,0l16.051-16.05   c4.302,2.06,8.706,3.887,13.194,5.475V315c0,8.284,6.716,15,15,15h60c8.284,0,15-6.716,15-15v-22.689   c4.489-1.589,8.894-3.416,13.196-5.476l16.051,16.05c5.857,5.857,15.355,5.857,21.213,0l42.426-42.426   c5.858-5.857,5.858-15.355,0-21.213l-16.05-16.051c2.061-4.304,3.889-8.708,5.476-13.196H315c8.284,0,15-6.716,15-15v-60   C330,126.716,323.284,120,315,120z M300,180h-18.781c-6.845,0-12.822,4.634-14.527,11.263c-2.436,9.472-6.213,18.576-11.227,27.06   c-3.482,5.894-2.533,13.396,2.308,18.237l13.294,13.294l-21.213,21.213l-13.294-13.294c-4.84-4.84-12.342-5.788-18.237-2.308   c-8.479,5.011-17.584,8.788-27.062,11.228c-6.628,1.706-11.261,7.683-11.261,14.526V300h-30v-18.781   c0-6.844-4.633-12.82-11.261-14.526c-9.476-2.44-18.579-6.217-27.06-11.228c-5.895-3.482-13.396-2.533-18.237,2.308l-13.294,13.294   l-21.215-21.213l13.294-13.294c4.841-4.84,5.79-12.343,2.308-18.236c-5.011-8.481-8.789-17.587-11.228-27.063   C61.602,184.633,55.625,180,48.781,180H30v-30h18.781c6.844,0,12.82-4.633,14.526-11.261c2.439-9.476,6.217-18.581,11.228-27.063   c3.482-5.894,2.533-13.397-2.308-18.236L58.934,80.146l21.214-21.213l13.294,13.294c4.84,4.84,12.345,5.79,18.237,2.308   c8.479-5.011,17.584-8.788,27.061-11.228C145.367,61.602,150,55.625,150,48.781V30h30v18.781c0,6.844,4.633,12.82,11.261,14.526   c9.478,2.44,18.583,6.217,27.062,11.228c5.893,3.48,13.396,2.533,18.237-2.308l13.294-13.294l21.213,21.213L257.772,93.44   c-4.841,4.841-5.79,12.344-2.308,18.237c5.014,8.483,8.79,17.588,11.227,27.06c1.705,6.629,7.683,11.263,14.527,11.263H300V180z"></path><path d="M203.95,152.28l-48-30c-4.624-2.891-10.453-3.043-15.222-0.4c-4.77,2.644-7.729,7.667-7.729,13.12v60   c0,5.453,2.959,10.477,7.729,13.12c2.266,1.255,4.77,1.88,7.271,1.88c2.764,0,5.523-0.763,7.95-2.28l48-30   c4.386-2.741,7.05-7.548,7.05-12.72S208.336,155.021,203.95,152.28z"></path></g></svg>}
                        title={"Automation"}
                        desciption={"Автоматжуулалт нь давтагддаг ажлуудыг хөнгөвчлөх, үйл явцыг хурдасгах, алдаа гаргах магадлалыг багасгах замаар байгууллагын үр ашгийг нэмэгдүүлдэг. Энэ нь бизнесийн үйл ажиллагааг илүү үр дүнтэй болгох, зардлыг бууруулах, цаг хугацааг хэмнэхэд тусалдаг. Автоматжуулалт нь технологийн дэвшлийг ашиглан үйл явц, өгөгдөл боловсруулах болон шинжилгээг автоматжуулах боломжийг олгодог."}
                        longDescription={
                          <div className="text-sm text-justify">
                            <p>
                              Автоматжуулалт нь Data Lake, Data Warehouse, болон Lakehouse зэрэг өгөгдөл хадгалах, боловсруулах системүүдийн үр ашгийг нэмэгдүүлэхэд чухал үүрэг гүйцэтгэдэг.
                            </p>
                            <ul className="list-disc ml-4">
                              <li>
                                <b>Data Lake</b>-ийн автоматжуулалт нь өгөгдлийг хурдан, үр ашигтай цуглуулах, хадгалах, өөрчлөх үйл явцыг автоматжуулснаар өгөгдлийн шинэчлэлтийг цаг тухайд нь хийх боломжийг олгодог.
                              </li>
                              <li>
                                <b>Data Warehouse</b>-ийн автоматжуулалт нь өгөгдлийг зохион байгуулалттайгаар цэвэрлэх, хувиргах, ачаалах (ETL) процессыг автоматжуулснаар өгөгдлийн боловсруулалт, шинжилгээг хялбаршуулдаг.
                              </li>
                              <li>
                                <b>Lakehouse</b>-ийн автоматжуулалт нь Data Lake болон Data Warehouse-ийн хамгийн сайн талуудыг нэгтгэж, өгөгдлийг хадгалах, боловсруулалт хийх процессыг хослуулан автоматжуулж, хэрэглэгчдэд бодит цагийн мэдээлэлд хандах боломжийг олгодог.
                              </li>
                            </ul>
                            <p>
                            Эдгээр автоматжуулалтын шийдлүүд нь өгөгдлийн удирдлагын үйл явцыг хурдасгаж, алдааг багасган, өгөгдлийг илүү үр дүнтэй ашиглах боломжийг байгууллагуудад олгодог.
                            </p>
                          </div>
                        }
                      />
                      <Product
                        logosvg={<svg className="w-10 h-10 dark:fill-white" xmlns="http://www.w3.org/2000/svg" version="1.1" id="Layer_1" viewBox="0 0 32 32"><path id="machine--learning--03_1_" d="M29.36,15.695v-3.389c0.575-0.159,1-0.681,1-1.305c0-0.75-0.61-1.36-1.36-1.36  c-0.191,0-0.372,0.04-0.537,0.111l-2.365-2.956C26.261,6.572,26.36,6.298,26.36,6c0-0.75-0.61-1.36-1.36-1.36  c-0.401,0-0.758,0.177-1.007,0.454l-3.659-1.83C20.351,3.179,20.36,3.091,20.36,3c0-0.75-0.61-1.36-1.36-1.36  c-0.625,0-1.147,0.425-1.306,1h-4.389c-0.159-0.575-0.681-1-1.305-1c-0.75,0-1.36,0.61-1.36,1.36c0,0.091,0.01,0.179,0.027,0.264  l-2.66,1.33C7.758,4.318,7.401,4.14,7,4.14c-0.75,0-1.36,0.61-1.36,1.36c0,0.273,0.082,0.526,0.221,0.739L3.598,8.785  C3.417,8.695,3.216,8.64,3,8.64c-0.75,0-1.36,0.61-1.36,1.36c0,0.625,0.425,1.146,1,1.305v3.389c-0.575,0.159-1,0.681-1,1.305  c0,0.75,0.61,1.36,1.36,1.36c0.546,0,1.014-0.325,1.231-0.791l3.424,0.571C7.726,17.824,8.298,18.36,9,18.36  c0.091,0,0.179-0.01,0.264-0.027l0.83,1.659C9.818,20.242,9.64,20.599,9.64,21c0,0.75,0.61,1.36,1.36,1.36  c0.47,0,0.885-0.24,1.13-0.604l3.518,1.173C15.646,22.953,15.64,22.976,15.64,23c0,0.625,0.425,1.147,1,1.306v3.388  c-0.575,0.159-1,0.681-1,1.306c0,0.75,0.61,1.36,1.36,1.36s1.36-0.61,1.36-1.36c0-0.624-0.425-1.147-1-1.306v-3.389  c0.575-0.159,1-0.681,1-1.306c0-0.452-0.224-0.85-0.564-1.098l0.682-1.82l3.163,0.904c0,0.005-0.001,0.01-0.001,0.015  c0,0.624,0.425,1.147,1,1.306v5.389c-0.575,0.159-1,0.681-1,1.306c0,0.75,0.61,1.36,1.36,1.36s1.36-0.61,1.36-1.36  c0-0.624-0.425-1.147-1-1.306v-5.389c0.575-0.159,1-0.681,1-1.306c0-0.149-0.03-0.29-0.074-0.424l3.828-2.553  C28.353,18.231,28.66,18.36,29,18.36c0.75,0,1.36-0.61,1.36-1.36C30.36,16.376,29.935,15.854,29.36,15.695z M21.354,14.932  c-0.002-0.045-0.007-0.09-0.014-0.134l3.049-1.355l3.313,2.899L21.354,14.932z M20,15.64c-0.353,0-0.64-0.287-0.64-0.64  s0.287-0.64,0.64-0.64s0.64,0.287,0.64,0.64S20.353,15.64,20,15.64z M20,13.64c-0.75,0-1.36,0.61-1.36,1.36  c0,0.452,0.224,0.85,0.564,1.097l-1.166,3.11l-1.902-0.543l-1.465-5.126l5.463-3.756l0.628,0.489l3.028,2.65l-2.745,1.22  C20.796,13.838,20.423,13.64,20,13.64z M9.131,15.653L8.122,9.85l3.612-0.361V9.485C11.93,9.995,12.421,10.36,13,10.36  c0.005,0,0.009-0.001,0.014-0.001l0.823,2.879l-3.966,2.726C9.666,15.792,9.412,15.681,9.131,15.653z M13,9.64  c-0.353,0-0.64-0.287-0.64-0.64S12.647,8.36,13,8.36S13.64,8.647,13.64,9S13.353,9.64,13,9.64z M10.28,16.557l3.765-2.589  l1.275,4.463l-4.962-1.418c0-0.005,0.001-0.009,0.001-0.014C10.36,16.844,10.328,16.697,10.28,16.557z M24.129,7.036  C24.366,7.235,24.667,7.36,25,7.36c0.191,0,0.372-0.04,0.537-0.111l2.365,2.955C27.739,10.428,27.64,10.702,27.64,11  c0,0.069,0.01,0.135,0.02,0.201l-3.144,1.397l-3.295-2.883l-0.464-0.361L24.129,7.036z M28.251,15.866l-3.138-2.745l2.841-1.262  c0.176,0.213,0.412,0.371,0.686,0.446v3.389C28.501,15.733,28.369,15.789,28.251,15.866z M29.64,11c0,0.353-0.287,0.64-0.64,0.64  s-0.64-0.287-0.64-0.64s0.287-0.64,0.64-0.64S29.64,10.647,29.64,11z M25,5.36c0.353,0,0.64,0.287,0.64,0.64S25.353,6.64,25,6.64  S24.36,6.353,24.36,6S24.647,5.36,25,5.36z M19,2.36c0.353,0,0.64,0.287,0.64,0.64S19.353,3.64,19,3.64S18.36,3.353,18.36,3  S18.647,2.36,19,2.36z M19,4.36c0.401,0,0.758-0.177,1.007-0.454l3.659,1.83C23.649,5.821,23.64,5.909,23.64,6  c0,0.156,0.032,0.303,0.08,0.443l-3.56,2.448l-6.904-5.37c0.021-0.051,0.035-0.106,0.05-0.161h4.389  C17.853,3.935,18.375,4.36,19,4.36z M12,2.36c0.353,0,0.64,0.287,0.64,0.64S12.353,3.64,12,3.64S11.36,3.353,11.36,3  S11.647,2.36,12,2.36z M10.993,3.906C11.242,4.182,11.599,4.36,12,4.36c0.304,0,0.583-0.104,0.81-0.274l6.728,5.232l-5.075,3.489  l-0.757-2.65C14.096,9.918,14.36,9.491,14.36,9c0-0.75-0.61-1.36-1.36-1.36c-0.673,0-1.229,0.492-1.337,1.135V8.772L7.998,9.138  l-0.42-2.412C8.039,6.508,8.36,6.042,8.36,5.5c0-0.091-0.01-0.179-0.027-0.264L10.993,3.906z M4.265,9.511  C4.231,9.423,4.19,9.339,4.139,9.261l2.263-2.546c0.143,0.071,0.3,0.115,0.467,0.132L7.28,9.21L4.265,9.511z M7,4.86  c0.353,0,0.64,0.287,0.64,0.64S7.353,6.14,7,6.14S6.36,5.853,6.36,5.5S6.647,4.86,7,4.86z M2.36,10c0-0.353,0.287-0.64,0.64-0.64  S3.64,9.647,3.64,10S3.353,10.64,3,10.64S2.36,10.353,2.36,10z M3,16.64c-0.353,0-0.64-0.287-0.64-0.64S2.647,15.36,3,15.36  S3.64,15.647,3.64,16C3.64,16.353,3.353,16.64,3,16.64z M7.769,16.43l-3.424-0.571c-0.059-0.561-0.455-1.018-0.986-1.165v-3.389  c0.503-0.139,0.888-0.556,0.977-1.077l3.067-0.307l1.018,5.853C8.135,15.91,7.904,16.142,7.769,16.43z M8.36,17  c0-0.353,0.287-0.64,0.64-0.64S9.64,16.647,9.64,17S9.353,17.64,9,17.64S8.36,17.353,8.36,17z M11,21.64  c-0.353,0-0.64-0.287-0.64-0.64s0.287-0.64,0.64-0.64s0.64,0.287,0.64,0.64S11.353,21.64,11,21.64z M12.353,21.071  c0.001-0.024,0.007-0.047,0.007-0.071c0-0.75-0.61-1.36-1.36-1.36c-0.091,0-0.179,0.01-0.264,0.027l-0.83-1.659  c0.098-0.088,0.182-0.189,0.251-0.302l5.396,1.541l0.742,2.596c-0.168,0.103-0.315,0.238-0.425,0.402L12.353,21.071z M17.64,29  c0,0.353-0.287,0.64-0.64,0.64c-0.353,0-0.64-0.287-0.64-0.64s0.287-0.64,0.64-0.64C17.353,28.36,17.64,28.647,17.64,29z M17,23.64  c-0.353,0-0.64-0.287-0.64-0.64s0.287-0.64,0.64-0.64c0.353,0,0.64,0.287,0.64,0.64S17.353,23.64,17,23.64z M17.121,21.652  C17.08,21.648,17.041,21.64,17,21.64c-0.005,0-0.009,0.001-0.014,0.001l-0.618-2.162l1.416,0.404L17.121,21.652z M18.732,19.406  l1.147-3.059c0.041,0.004,0.08,0.012,0.121,0.012c0.519,0,0.967-0.296,1.196-0.725l6.451,1.433c0.006,0.124,0.03,0.243,0.068,0.356  l-3.828,2.553C23.647,19.769,23.34,19.64,23,19.64c-0.491,0-0.918,0.264-1.158,0.655L18.732,19.406z M23.64,29  c0,0.353-0.287,0.64-0.64,0.64s-0.64-0.287-0.64-0.64s0.287-0.64,0.64-0.64S23.64,28.647,23.64,29z M23,21.64  c-0.353,0-0.64-0.287-0.64-0.64s0.287-0.64,0.64-0.64s0.64,0.287,0.64,0.64S23.353,21.64,23,21.64z M29,17.64  c-0.353,0-0.64-0.287-0.64-0.64c0-0.353,0.287-0.64,0.64-0.64s0.64,0.287,0.64,0.64C29.64,17.353,29.353,17.64,29,17.64z"></path></svg>}
                        title={"Machine Learning"}
                        desciption={"Machine Learning (ML) нь компьютерт тодорхой зааварчилгаагүйгээр даалгавруудыг гүйцэтгэх боломжийг олгодог алгоритм, статистик загваруудыг боловсруулахад чиглэсэн хиймэл оюун ухааны (AI) дэд хэсэг юм. Машин сургалтын загварууд нь тодорхой дүрмээр програмчлагдсан байхын оронд хэв маягийг сурч, өгөгдөлд үндэслэн шийдвэр гаргадаг. Энэ арга нь системд илүү их өгөгдөлд өртөх тусам даалгаврынхаа гүйцэтгэлийг сайжруулах боломжийг олгодог."}
                        longDescription={
                          <div className="text-sm text-justify">
                            Machine Learning (ML) нь хиймэл оюун ухааны (AI) салбар бөгөөд тодорхой програмчлалгүйгээр компьютерт даалгавруудыг гүйцэтгэх боломжийг олгодог алгоритм, статистик загвар боловсруулахад чиглэдэг. Эдгээр алгоритмууд нь хэв маягийг тодорхойлох, шийдвэр гаргах эсвэл үр дүнг урьдчилан таамаглахын тулд өгөгдлөөс суралцаж, илүү их мэдээлэл боловсруулах тусам улам үнэн зөв болж байна.
                          </div>
                        }
                      />
                      <Product
                        logosvg={
                          <svg className="w-10 h-10 dark:fill-white" xmlns="http://www.w3.org/2000/svg" version="1.1" id="Capa_1"  viewBox="0 0 183.899 183.899">
                          <g>
                            <g>
                              <path d="M171.178,78.313c-3.203-11.478-12.349-19.829-23.248-19.829c-0.128,0-0.244,0.039-0.365,0.045    c-1.754-21.811-17.33-38.946-36.499-38.946c-10.784,0-20.398,5.511-27.146,14.124c-4.253-4.104-9.639-6.673-15.582-6.673    c-13.341,0-24.156,12.428-24.509,27.879c-2.338-1.035-4.853-1.672-7.502-1.672c-11.755,0-21.275,11.104-21.275,24.798    C6.734,78.039,0,85.888,0,95.576c0,9.682,6.734,17.53,15.052,17.53c0.094,0,11.106,0,27.136,0    c0-23.321,16.161-43.242,38.404-48.43V50.647l31.545,19.717l2.581-1.611l3.301,2.04c14.833,9.167,23.687,24.984,23.687,42.313    c16.051,0,27.061,0,27.14,0c8.317,0,15.053-7.849,15.053-17.53C183.899,86.82,178.375,79.622,171.178,78.313z"/>
                              <path d="M58.669,113.113c0-16.605,12.239-30.373,28.166-32.848v7.246l20.48-12.802l-20.48-12.8v8.004    c-21.595,2.551-38.404,20.931-38.404,43.2c0,15.637,8.312,29.337,20.733,37.01l10.038-6.278    C67.16,138.833,58.669,126.947,58.669,113.113z"/>
                              <path d="M114.744,76.106l-10.041,6.271c12.038,5.015,20.533,16.9,20.533,30.735c0,16.604-12.239,30.372-28.163,32.845v-7.246    l-20.483,12.806l20.483,12.799v-8.007c21.593-2.545,38.398-20.935,38.398-43.196C135.471,97.475,127.154,83.775,114.744,76.106z"/>
                            </g>
                          </g>
                          </svg>
                        }
                        title={"Data Governance"}
                        desciption={"Data Governance гэдэг нь байгууллагын өгөгдлийг үр ашигтай, аюулгүй, тууштай удирдах, чанартай байлгах, зохицуулахад чиглэсэн бодлого, журам, арга хэрэгслүүдийн цогц юм. Энэ нь өгөгдлийн нууцлал, үнэн зөв байдал, хүртээмжийг хангах замаар бизнесийн үйл ажиллагааг дэмжихэд тусалдаг."}
                        longDescription={
                          <div className="text-sm text-justify">
                            <p>
                            <b>Data Governance</b> нь байгууллагын өгөгдлийг зохион байгуулах, удирдах, хамгаалах, ашиглахад чиглэсэн цогц арга хэмжээ, бодлого, журмыг хэлдэг. Энэ нь өгөгдлийн амьдралын мөчлөгийн бүх үе шатанд (цуглуулах, хадгалах, боловсруулах, архивлах, устгах) өгөгдлийн чанар, нууцлал, хүртээмжийг хангахад чиглэгдсэн байдаг.
                            <p>
                            </p>
                            Data Governance нь өгөгдлийг зөв удирдах замаар байгууллагын үйл ажиллагааны үр ашиг, мэдээллийн үнэн зөв байдал, нийцэл, аюулгүй байдлыг баталгаажуулдаг. Үүний тулд байгууллагын хэмжээнд өгөгдлийн стандартууд, үүрэг хариуцлага, нэвтрэх эрхийн хязгаарлалт, аудитын зам мөрийг тодорхойлж, хэрэгжүүлдэг. Энэ нь бизнесийн зөв шийдвэр гаргах, хууль эрх зүйн шаардлагыг хангах, өгөгдлийн зөрчлөөс урьдчилан сэргийлэхэд чухал үүрэгтэй.
                            </p>
                          </div>
                        }
                      />
                      
                  </div>
                </div>
              </div>
            </section>
            <section className="flex min-h-screen w-full snap-start py-32" id="contact">
              <div className="container mx-auto  xl:max-w-7xl">
                <div className="py-24">
                  <h2 className="text-3xl lg:text-5xl uppercase font-black text-center">CONTACT</h2>
                  <p className="font-extralight text-xl text-center max-w-2xl mx-auto mt-3">
                    If you’d like more details about our company or products, please don’t hesitate to contact us. We’re here to help with any questions you might have.
                  </p>
                </div>
                <div className="grid grid-cols-1 lg:grid-cols-2 mt-12 lg:mt-24 gap-12">
                    <div className="flex flex-col gap-6">
                      <div className="flex flex-row items-center gap-6">
                      <div>
                          <svg className="w-8 h-8 stroke-black dark:stroke-white" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path className="stroke-2" d="M4 7.00005L10.2 11.65C11.2667 12.45 12.7333 12.45 13.8 11.65L20 7" strokeLinecap="round" strokeLinejoin="round"/>
                            <rect className="stroke-2" x="3" y="5" width="18" height="14" rx="2"  strokeLinecap="round"/>
                          </svg>
                        </div>
                      <div>munkhbaatar.b@datadi.mn</div>
                      </div>
                      <div className="flex flex-row items-center gap-6">
                        <div>
                          <svg className="w-8 h-8 stroke-black dark:stroke-white" xmlns="http://www.w3.org/2000/svg"  viewBox="0 0 24 24" fill="none">
                          <path d="M16.5562 12.9062L16.1007 13.359C16.1007 13.359 15.0181 14.4355 12.0631 11.4972C9.10812 8.55901 10.1907 7.48257 10.1907 7.48257L10.4775 7.19738C11.1841 6.49484 11.2507 5.36691 10.6342 4.54348L9.37326 2.85908C8.61028 1.83992 7.13596 1.70529 6.26145 2.57483L4.69185 4.13552C4.25823 4.56668 3.96765 5.12559 4.00289 5.74561C4.09304 7.33182 4.81071 10.7447 8.81536 14.7266C13.0621 18.9492 17.0468 19.117 18.6763 18.9651C19.1917 18.9171 19.6399 18.6546 20.0011 18.2954L21.4217 16.883C22.3806 15.9295 22.1102 14.2949 20.8833 13.628L18.9728 12.5894C18.1672 12.1515 17.1858 12.2801 16.5562 12.9062Z" />
                          </svg>
                        </div>
                        <div>+976 8882 8883</div>
                      </div>
                      <div className="flex flex-row items-center gap-6">
                        <div>
                        <svg className="w-8 h-8 stroke-black dark:stroke-white fill-sky-500" xmlns="http://www.w3.org/2000/svg"  viewBox="0 0 24 24" id="facebook" data-name="Flat Line" ><path id="secondary" d="M14,7h4V3H14A5,5,0,0,0,9,8v3H6v4H9v6h4V15h3l1-4H13V8A1,1,0,0,1,14,7Z" /></svg>
                        </div>
                        <div><a href="https://www.facebook.com/datadillc/">https://www.facebook.com/datadillc/</a></div>
                      </div>
                      <div className="flex flex-row items-center gap-6">
                        <div>
                          <svg className="w-8 h-8" xmlns="http://www.w3.org/2000/svg"  version="1.0" id="Layer_1" viewBox="0 0 64 64" >
                          <g>
                            <path fill="#F76D57" d="M32,52.789l-12-18C18.5,32,16,28.031,16,24c0-8.836,7.164-16,16-16s16,7.164,16,16   c0,4.031-2.055,8-4,10.789L32,52.789z"/>
                            <g>
                              <path className="dark:fill-white" d="M32,0C18.746,0,8,10.746,8,24c0,5.219,1.711,10.008,4.555,13.93c0.051,0.094,0.059,0.199,0.117,0.289    l16,24C29.414,63.332,30.664,64,32,64s2.586-0.668,3.328-1.781l16-24c0.059-0.09,0.066-0.195,0.117-0.289    C54.289,34.008,56,29.219,56,24C56,10.746,45.254,0,32,0z M44,34.789l-12,18l-12-18C18.5,32,16,28.031,16,24    c0-8.836,7.164-16,16-16s16,7.164,16,16C48,28.031,45.945,32,44,34.789z"/>
                              <circle className="dark:fill-white" cx="32" cy="24" r="8"/>
                            </g>
                          </g>
                          </svg>
                        </div>
                        <div>
                          City tower 1914, Sukhbaatar
                          District 8, Ulaanbaatar,
                          Mongolia
                        </div>
                      </div>
                    </div>
                    <div className="flex place-items-center justify-center">
                        <iframe
                          className="flex border-2 rounded-md w-full h-full items-center justify-center	"
                          loading="lazy"
                          src="https://www.google.com/maps/embed/v1/place?key=AIzaSyCgFWCbHn3SOr3vCHrIXLCZrXdqKfy80T4
                            &q=City+tower+business+center">
                        </iframe>
                      </div>
                </div>
              </div>
            </section>
            
          </div>
      </div>
   </div>
  );
}
